spree_brands_on_taxons/app/models/spree/product_decorator.rb

  scope :with_taxons_visibilities, ->(visibilities) { includes(:taxons).where(:spree_taxons => {visibility: visibilities}).map(&:id) }
---
SELECT  "spree_taxons".* FROM "spree_taxons" INNER JOIN "spree_taxonomies" ON "spree_taxonomies"."id" = "spree_taxons"."taxonomy_id" INNER JOIN "spree_products_taxons" ON "spree_taxons"."id" = "spree_products_taxons"."taxon_id" WHERE "spree_products_taxons"."product_id" = $1 AND (spree_taxonomies.name = 'Brands')  ORDER BY "spree_taxons"."id" ASC LIMIT 1