app/helpers/application_helper.rb

SELECT  "collection_images".* FROM "collection_images" WHERE "collection_images"."position" = $1  ORDER BY "collection_images"."id" ASC LIMIT 1
---
  def get_slider6_image
	  @slider6_imgs = CollectionImage.where(position: 6).first

SELECT  "collection_images".* FROM "collection_images" WHERE "collection_images"."position" = $1  ORDER BY "collection_images"."id" ASC LIMIT 1
---
  def get_slider6_hoover_image
	  @slider6_hoover_imgs = CollectionImage.where(position: 7).first