app/controllers/spree/checkout_controller_decorator.rb

  def pay_with_mollie
    #debugger
    if (params[:state] == 'select_payment_method')
      @order[:payment_state] = params[:which_payment] || 1
    end
    return unless params[:state] == 'payment'
    if params[:order][:payments_attributes] != nil
      pm_id = params[:order][:payments_attributes].first[:payment_method_id]
      payment_method = Spree::PaymentMethod.find(pm_id)
---
SELECT  "spree_payment_methods".* FROM "spree_payment_methods" WHERE "spree_payment_methods"."deleted_at" IS NULL AND "spree_payment_methods"."id" = $1 LIMIT 1